backend/app/controllers/api/empleados_controller.rb

    def index
      empleados = Empleado.all
      empleados = empleados.where("nombre LIKE ?", "%#{params[:nombre]}%") if params[:nombre]
      empleados = empleados.where(area: params[:area]) if params[:area]
---
SELECT "empleados".* FROM "empleados"
SELECT "empleados".* FROM "empleados" WHERE (nombre LIKE '%%') AND "empleados"."area" = ''

    def create
      empleado = Empleado.new(empleado_params)
      if empleado.save
---
INSERT INTO "empleados" ("nombre", "email", "area", "fecha_ingreso", "estado", "created_at", "updated_at") VALUES ('sofia', 'sofia@prueba.com', 'IT', '1999-08-13', 'activo', '2025-07-29 18:19:27.723641', '2025-07-29 18:19:27.723641') RETURNING "id"

    def set_empleado
      @empleado = Empleado.find(params[:id])
---
SELECT "empleados".* FROM "empleados" WHERE "empleados"."id" = 2 LIMIT 1